app/Services/UserLogRecorder.php

select exists(select * from `users` where `id` = 1) as `exists`
select * from `user_logs` where `user_id` = 1 and `event_type` = 'login' order by `id` desc limit 1
insert into `user_logs` (`ip_address`, `user_agent`, `browser`, `platform`, `device`, `user_id`, `event_type`, `updated_at`, `created_at`) values ('127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/145.0.0.0 Safari/537.36', 'Chrome', 'Windows', 'Desktop', 1, 'login', '2026-02-28 13:06:09', '2026-02-28 13:06:09')
---
    public function record(int $userId, string $eventType, array $payload): void
    {
        // Defensive: ensure the referenced user still exists before inserting a log.
        if (! User::where('id', $userId)->exists()) {
            // User no longer exists; skip recording to avoid FK violations.
            return;
        }

        $now = Carbon::now();

        $attributes = array_merge($payload, [
            'user_id' => $userId,
            'event_type' => $eventType,
        ]);

        $recent = UserLog::query()
            ->where('user_id', $userId)
            ->where('event_type', $eventType)
            ->orderByDesc('id')
            ->first();

        if ($recent && $this->isDuplicate($recent, $attributes, $now)) {
            $recent->fill($attributes);
            $recent->updated_at = $now;
            $recent->save();

            return;
        }

        try {
            UserLog::create($attributes);