routes/web.php

select * from `academic_periods` where `is_deleted` = 0 order by `academic_year` desc, FIELD(semester, '1st', '2nd', 'Summer')
---
});

// Academic Period Selection
Route::middleware('auth')->group(function () {
    Route::get('/select-academic-period', function () {
        $periods = \App\Models\AcademicPeriod::where('is_deleted', false)
            ->orderByDesc('academic_year')
            ->orderByRaw("FIELD(semester, '1st', '2nd', 'Summer')")
            ->get();

        return view('instructor.select-academic-period', compact('periods'));
    })->name('select.academicPeriod');

    Route::post('/set-academic-period', function (Request $request) {
        $request->validate([
            'academic_period_id' => 'required|exists:academic_periods,id',
        ]);
        session(['active_academic_period_id' => $request->academic_period_id]);
        return redirect()->intended('/dashboard');
    })->name('set.academicPeriod');
});