app/Http/Controllers/AdminController.php

select * from `departments` where `is_deleted` = 0 order by `department_code` asc
---
    public function departments()
    {
        Gate::authorize('admin');

        $departments = Department::where('is_deleted', false)
            ->orderBy('department_code')
            ->get();

select * from `users` where `users`.`id` in (1)
---
    public function revokeUserSessions(Request $request)
    {
        Gate::authorize('admin');

        $request->validate([
            'user_id' => 'required|integer|exists:users,id',
            'password' => 'required|string',
        ]);

        // Verify admin password
        if (!Hash::check($request->input('password'), Auth::user()->password)) {
            return back()
                ->withErrors(['password' => 'The provided password is incorrect.'])
                ->withInput();
        }

        $userId = $request->input('user_id');

        // Prevent admin from revoking their own sessions
        if ($userId === Auth::id()) {
            return back()
                ->withErrors(['user_id' => 'You cannot revoke your own sessions.'])
                ->withInput();
        }

        // Get user info
        $user = User::findOrFail($userId);