app/Http/Controllers/DashboardController.php

    private function getInstructorSubjects($instructorId, $academicPeriodId)
    {
        // Use a JOIN instead of orWhereHas (avoids slow EXISTS subquery)
        $primaryIds = Subject::where('instructor_id', $instructorId)
            ->where('academic_period_id', $academicPeriodId)
            ->where('is_deleted', false)
            ->pluck('id');

        $pivotIds = DB::table('instructor_subject')
            ->join('subjects', 'subjects.id', '=', 'instructor_subject.subject_id')
            ->where('instructor_subject.instructor_id', $instructorId)
            ->where('subjects.academic_period_id', $academicPeriodId)
            ->where('subjects.is_deleted', false)
            ->pluck('instructor_subject.subject_id');

        $allIds = $primaryIds->merge($pivotIds)->unique();

        return Subject::whereIn('id', $allIds)
            ->where('is_deleted', false)
            ->withCount(['students' => fn ($q) => $q->where('students.is_deleted', false)])
            ->get();
---
select * from `subjects` where (`instructor_id` = 5 or exists (select * from `users` inner join `instructor_subject` on `users`.`id` = `instructor_subject`.`instructor_id` where `subjects`.`id` = `instructor_subject`.`subject_id` and `instructor_id` = 5)) and `academic_period_id` = '1'

    private function getLoginStats($selectedDate)
    {
        $hours = range(0, 23);
        $hourExpression = $this->datePartExpression('hour');

        $successfulLogins = UserLog::selectRaw("{$hourExpression} as hour, COUNT(*) as total")
            ->where('event_type', 'login')
            ->whereDate('created_at', $selectedDate)
            ->groupByRaw($hourExpression)
            ->pluck('total', 'hour');

        $failedLogins = UserLog::selectRaw("{$hourExpression} as hour, COUNT(*) as total")
            ->where('event_type', 'failed_login')
            ->whereDate('created_at', $selectedDate)
            ->groupByRaw($hourExpression)
            ->pluck('total', 'hour');
---
select MONTH(created_at) as month, COUNT(*) as total from `user_logs` where `event_type` = 'login' and year(`created_at`) = 2026 group by MONTH(created_at)
select MONTH(created_at) as month, COUNT(*) as total from `user_logs` where `event_type` = 'failed_login' and year(`created_at`) = 2026 group by MONTH(created_at)