app/Http/Controllers/DashboardController.php

select count(*) as aggregate from `users`
---
    private function getAdminStats()
    {
        $totalUsers = User::count();