app/Http/Requests/Auth/LoginRequest.php

    public function authenticate(): User
    {
        $this->ensureIsNotRateLimited();

        // Check if user exists but is deactivated before attempting authentication
        $user = User::where('email', $this->input('email'))->first();
---
select * from `users` where `email` = 'admin@brokenshire.edu.ph' limit 1